# 2) Напишите программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# !(x*y*z)=!x+!y+!z => x*y*z=x+y+z
# Варианты значений: 1) х = 0, y = 0, z = 0; 2) x = 1; y = 0, z = 0; 3) x = 1, y = 1, z = 0; 4) x = 1, y = 1, z = 1;
# 5) x = 0, y = 1, z = 0; 6) x = 0, y = 1, z = 1; 7) x = 0, y = 0, z = 1; 8) x = 1, y = 0, z = 1

print('Введите значения переменных, равные 0 или 1')
x = int(input('x = '))
y = int(input('y = '))
z = int(input('z = '))
a = x * y * z
b = x + y + z
print(a, '=', b)
if a == b:
    print('Thrue')
else:
    print('False')
